<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of beook.</string>
		<key>Identifier</key>
		<string>com.github.ahousseini-recipes.download.beook</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>beook</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>re_pattern</key>
					<string>https://beook.ch/downloads/setup/mac64/beook_mac64_install_[0-9\.]*.pkg</string>
					<key>result_output_var_name</key>
					<string>url</string>
					<key>url</key>
					<string>https://beook.ch/cms/tiki-index.php?page=Download</string>
				</dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%</string>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: ionesoft GmbH (6ACL729794)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
