<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Set ARCH to "" for x86_64 and "-arm" for arm64.</string>
	<key>Description</key>
	<string>Downloads the latest version of mBlock and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.ahousseini-recipes.pkg.mBlock</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>-arm</string>
		<key>NAME</key>
		<string>mBlock</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.ahousseini-recipes.download.mBlock</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%%ARCH%-%version%</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
