<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Created with Recipe Robot v2.0.0 (https://github.com/homebysix/recipe-robot)</string>
		<key>Description</key>
		<string>Downloads the latest version of mBlock.</string>
		<key>Identifier</key>
		<string>com.github.ahousseini-recipes.download.mBlock</string>
		<key>Input</key>
		<dict>
			<key>APP_FILENAME</key>
			<string>mblock</string>
			<key>NAME</key>
			<string>mBlock</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>re_pattern</key>
					<string>https://dl.makeblock.com/mblock5/darwin/V[0-9\.]*.pkg</string>
					<key>result_output_var_name</key>
					<string>url</string>
					<key>url</key>
					<string>https://www.mblock.cc/download/</string>
				</dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: Makeblock Co., Ltd. (XWN8AWFG9J)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
					<key>input_path</key>
					<string>%pathname%</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
		</array>
	</dict>
</plist>
