<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.ahousseini-recipes.download.PrusaSlicer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PrusaSlicer</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>cask_name</key>
				<string>prusaslicer</string>
			</dict>
			<key>Processor</key>
			<string>com.github.ahousseini-recipes.SharedProcessors/HomebrewCaskURL</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>	
		<dict>
			<key>Arguments</key>
			<dict>
			  <key>url</key>
			  <string>%asset_url%</string>
				<key>re_pattern</key>
				<string><![CDATA[(?<=\/PrusaSlicer-)[\d\.]+]]></string>
				<key>result_output_var_name</key>
				<string>version</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Original Prusa Drivers/PrusaSlicer.app</string>
				<key>requirement</key>
				<string>identifier "com.prusa3d.slic3r/" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = DKPB65N43Z</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
