<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the latest version of MediathekView and creates a package.</string>
    <key>Identifier</key>
    <string>com.github.ahousseini-recipes.pkg.MediathekView</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>MediathekView</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.ahousseini-recipes.download.MediathekView</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>PkgRootCreator</string>
        <key>Arguments</key>
        <dict>
          <key>archive_path</key>
          <string>%NAME%-latest-mac.dmg</string>
          <key>pkgroot</key>
          <string>%RECIPE_CACHE_DIR%/pkgroot</string>
          <key>pkgdirs</key>
          <dict>
            <key>Applications</key>
            <string>0775</string>
          </dict>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Copier</string>
        <key>Arguments</key>
        <dict>
          <key>source_path</key>
          <string>%pathname%/MediathekView/</string>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/pkgroot/Applications/MediathekView/</string>
          <key>overwrite</key>
          <true/>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>Versioner</string>
        <key>Arguments</key>
        <dict>
          <key>input_plist_path</key>
          <string>%RECIPE_CACHE_DIR%/pkgroot/Applications/MediathekView/MediathekView.app/Contents/Info.plist</string>
          <key>plist_version_key</key>
          <string>CFBundleVersion</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>PkgCreator</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_request</key>
          <dict>
            <key>chown</key>
            <array>
              <dict>
                <key>group</key>
                <string>admin</string>
                <key>path</key>
                <string>/</string>
                <key>user</key>
                <string>root</string>
              </dict>
            </array>
            <key>id</key>
            <string>com.install4j.2884-1958-5872-3865.59</string>
            <key>options</key>
            <string>purge_ds_store</string>
            <key>pkgname</key>
            <string>%NAME%-%version%</string>
            <key>pkgroot</key>
            <string>%pkgroot%</string>
            <key>version</key>
            <string>%version%</string>
          </dict>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
