<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Created with Recipe Robot v2.0.0 (https://github.com/homebysix/recipe-robot)</string>
		<key>Description</key>
		<string>Downloads the latest version of NordVPN and creates a package.</string>
		<key>Identifier</key>
		<string>com.github.ahousseini-recipes.pkg.NordVPN</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>NordVPN</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.ahousseini-recipes.download.NordVPN</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>flat_pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/exports/NordVPN_Sideload.pkg</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/com.nordvpn.osx.pkg/Payload</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/version_check</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Versioner</string>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%RECIPE_CACHE_DIR%/version_check/NordVPN.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCopier</string>
				<key>Arguments</key>
				<dict>
					<key>source_pkg</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/exports/NordVPN_Sideload.pkg</string>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/unpack</string>
						<string>%RECIPE_CACHE_DIR%/version_check</string>
					</array>
				</dict>
				<key>Processor</key>
				<string>PathDeleter</string>
			</dict>
		</array>
	</dict>
</plist>
