<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of SketchBook.</string>
		<key>Identifier</key>
		<string>com.github.ahousseini-recipes.download.SketchBook</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>SketchBook</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://www.autodesk.com/products/sketchbook/free-download</string>
					<key>re_pattern</key>
					<string>https://download\.autodesk\.com/us/support/files/sketchbook/sketchbook_2019/sketchbook_.*\.dmg</string>
					<key>result_output_var_name</key>
					<string>url</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: Autodesk (XXKJ396S2Y)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
					<key>input_path</key>
					<string>%pathname%/SketchBook*.pkg</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
