<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of SketchBook.</string>
		<key>Identifier</key>
		<string>com.github.ahousseini-recipes.download.SketchBook</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>SketchBook</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.1.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>DeprecationWarning</string>
				<key>Arguments</key>
				<dict>
					<key>warning_message</key>
					<string>SketchBook is now available via the AppStore only: https://apps.apple.com/us/app/sketchbook-pro/id1570472288. As such, this recipe no longer works.</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>TRUEPREDICATE</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
