<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Synology Drive Client.</string>
		<key>Identifier</key>
		<string>com.github.ahousseini-recipes.download.SynologyDriveClient</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Synology Drive Client</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>re_pattern</key>
					<string>Version:\s*(\d+(?:\.\d+)*)</string>
					<key>result_output_var_name</key>
					<string>url_version_part_1</string>
					<key>url</key>
					<string>https://www.synology.com/en-us/releaseNote/SynologyDriveClient</string>
				</dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>re_pattern</key>
					<string>Version:\s*(\d+(?:\.\d+)*)-(\d+)</string>
					<key>result_output_var_name</key>
					<string>url_version_part_2</string>
					<key>url</key>
					<string>https://www.synology.com/en-us/releaseNote/SynologyDriveClient</string>
				</dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.dmg</string>
					<key>url</key>
					<string>https://global.download.synology.com/download/Utility/SynologyDriveClient/%url_version_part_1%-%url_version_part_2%/Mac/Installer/synology-drive-client-%url_version_part_2%.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: Synology Inc. (X85BAK35Y4)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
					<key>input_path</key>
					<string>%pathname%/Install Synology Drive Client.pkg</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<key>flat_pkg_path</key>
					<string>%pathname%/Install Synology Drive Client.pkg</string>
					<key>purge_destination</key>
					<true/>
				</dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/synology-drive.installer.pkg/Payload</string>
					<key>purge_destination</key>
					<true/>
				</dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/Synology Drive Client.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
		</array>
	</dict>
</plist>
