<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Synology Note Station.</string>
	<key>Identifier</key>
	<string>com.github.ahousseini-recipes.download.SynologyNoteStation</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Synology Note Station Client</string>
		<key>NAME</key>
		<string>Synology Note Station</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>Version:\s*(\d+(?:\.\d+)*-\d+)</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>https://www.synology.com/en-us/releaseNote/NoteStationClient</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://global.download.synology.com/download/Utility/NoteStationClient/%version%/Mac/x86_64/synology-note-station-client-%version%-mac-x64.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Synology Inc. (X85BAK35Y4)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%/.synology-note-station-client.installer.pkg</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
