<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Synology Drive Client.</string>
	<key>Identifier</key>
	<string>com.github.ahousseini-recipes.download.SynologyDriveClient</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Synology Drive Client</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>&gt;(\d+(?:\.\d+)*)-</string>
				<key>result_output_var_name</key>
				<string>url_version_part_1</string>
				<key>url</key>
				<string>https://archive.synology.com/download/Utility/SynologyDriveClient</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>&gt;(\d+(?:\.\d+)*)-(\d+)&lt;</string>
				<key>result_output_var_name</key>
				<string>url_version_part_2</string>
				<key>url</key>
				<string>https://archive.synology.com/download/Utility/SynologyDriveClient</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://global.download.synology.com/download/Utility/SynologyDriveClient/%url_version_part_1%-%url_version_part_2%/Mac/Installer/synology-drive-client-%url_version_part_2%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Synology Inc. (X85BAK35Y4)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%/Install Synology Drive Client.pkg</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
