<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Synology Surveillance Station Client.</string>
		<key>Identifier</key>
		<string>com.github.ahousseini-recipes.download.SynologySurveillanceStationClient</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Synology Surveillance Station Client</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>re_pattern</key>
					<string>&gt;\s*Version:\s*(\d+(?:\.\d+)*-\d+)\s*&lt;</string>
					<key>result_output_var_name</key>
					<string>version</string>
					<key>url</key>
					<string>https://www.synology.com/en-us/releaseNote/SurveillanceStationClient</string>
				</dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.dmg</string>
					<key>url</key>
					<string>https://global.download.synology.com/download/Utility/SurveillanceStationClient/%version%/Mac/Synology%20Surveillance%20Station%20Client-%version%.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: Synology Inc. (X85BAK35Y4)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
					<key>input_path</key>
					<string>%pathname%/Install Synology Surveillance Station Client.pkg</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<key>flat_pkg_path</key>
					<string>%pathname%/Install Synology Surveillance Station Client.pkg</string>
					<key>purge_destination</key>
					<true/>
				</dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/Surveillance_Station_Client.pkg/Payload</string>
					<key>purge_destination</key>
					<true/>
				</dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/Surveillance_Station_Client.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
		</array>
	</dict>
</plist>
