Description: Downloads the latest version of Clin doeil and creates a package.
Identifier: com.github.ahousseini-recipes.pkg.Clindoeil
ParentRecipe: com.github.ahousseini-recipes.download.Clindoeil
MinimumVersion: 1.0.0
Input:
  NAME: Clin doeil
Process:
  - Processor: PkgCopier
    Arguments:
      source_pkg: '%found_filename%'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
