<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Created with Recipe Robot v2.0.0 (https://github.com/homebysix/recipe-robot)</string>
		<key>Description</key>
		<string>Downloads the latest version of Sonos.</string>
		<key>Identifier</key>
		<string>com.github.ahousseini-recipes.download.Sonos</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Sonos</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.dmg</string>
					<key>url</key>
					<string>https://www.sonos.com/en/redir/controller_software_mac2</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/Sonos.app</string>
					<key>requirement</key>
					<string>identifier "com.sonos.macController" and anchor apple generic</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%pathname%/Sonos.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
		</array>
	</dict>
</plist>
