<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Zoiper.</string>
		<key>Identifier</key>
		<string>com.github.ahousseini-recipes.download.Zoiper</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Zoiper</string>
			<key>MAJOR_RELEASE</key>
			<string>5</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.pkg</string>
					<key>url</key>
					<string>https://www.zoiper.com/en/voip-softphone/download/zoiper%MAJOR_RELEASE%/for/mac</string>
					<key>request_headers</key>
					<dict>
						<key>Cookie</key>
						<string>PHPSESSID=hsb389p74h850bc56caldaqge5</string>
					</dict>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%</string>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: Securax (8923WVMRDE)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
