<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Oxford Learners Bookshelf.</string>
	<key>Identifier</key>
	<string>com.github.ahousseini-recipes.download.OxfordLearnersBookshelf</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Oxford Learners Bookshelf</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>span&gt;v&lt;!-- --&gt;(\d+(?:\.\d+)+)&lt;/span</string>
				<key>result_output_var_name</key>
				<string>download_version</string>
				<key>url</key>
				<string>https://www.oxfordlearnersbookshelf.com/home/appDownload</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://d1q4kqb8azk0w4.cloudfront.net/prod/osx-x64/Oxford%20Learners%20Bookshelf-%download_version%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Oxford Learners Bookshelf.app</string>
				<key>requirement</key>
				<string>identifier "com.oxfordlearnersbookshelf.ods" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = P3R4LS7R2H</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Oxford Learners Bookshelf.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
