<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Created with Recipe Robot v2.0.0 (https://github.com/homebysix/recipe-robot)</string>
		<key>Description</key>
		<string>Downloads the latest version of Flash Player.</string>
		<key>Identifier</key>
		<string>com.github.ahousseini-recipes.download.FlashPlayer</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Flash Player</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.1.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>DeprecationWarning</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>StopProcessingIf</string>
				<key>Arguments</key>
				<dict>
					<key>predicate</key>
					<string>TRUEPREDICATE</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>cask_name</key>
					<string>flash-player</string>
				</dict>
				<key>Processor</key>
				<string>com.github.ahousseini-recipes.SharedProcessors/HomebrewCaskURL</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/Flash Player.app</string>
					<key>requirement</key>
					<string>anchor apple generic and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JQ525L2MZD)</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%pathname%/Flash Player.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
		</array>
	</dict>
</plist>
