<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Created with Recipe Robot v2.0.0 (https://github.com/homebysix/recipe-robot)</string>
		<key>Description</key>
		<string>Downloads the latest version of vSolution Link by WolfVision.</string>
		<key>Identifier</key>
		<string>com.github.ahousseini-recipes.download.vSolutionLinkbyWolfVision</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>vSolution Link by WolfVision</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.dmg</string>
					<key>url</key>
					<string>https://download.wolfvision.com/vSolution_Link_by_WolfVision.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/vSolution Link by WolfVision.app</string>
					<key>requirement</key>
					<string>identifier "com.wolfvision.connapp" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: Harald Gaechter (YYUU2RS24Z)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%pathname%/vSolution Link by WolfVision.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleVersion</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
		</array>
	</dict>
</plist>
