<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of BiBox.</string>
		<key>Identifier</key>
		<string>com.github.ahousseini-recipes.download.BiBox</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>BiBox</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.dmg</string>
					<key>url</key>
					<string>https://static.bibox2.westermann.de/apps/mac</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%pathname%/BiBox*.app</string>
				</dict>
				<key>Processor</key>
				<string>FileFinder</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/%dmg_found_filename%</string>
					<key>requirement</key>
					<string>identifier "de.westermann.bibox2" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "77D93ZN7PT"</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>source_path</key>
					<string>%pathname%/%dmg_found_filename%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/BiBox.app</string>
					<key>overwrite</key>
					<true/>
				</dict>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
		</array>
	</dict>
</plist>
