<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Logitech Options and creates a package.</string>
		<key>Identifier</key>
		<string>com.github.ahousseini-recipes.pkg.LogitechOptions</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Logitech Options</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.ahousseini-recipes.download.LogitechOptions</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/LogiMgr Installer*.app/Contents/Info.plist</string>
				</dict>
				<key>Processor</key>
				<string>FileFinder</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%found_filename%</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pattern</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/LogiMgr Installer*.app/Contents/Resources/LogiMgr.pkg</string>
				</dict>
				<key>Processor</key>
				<string>FileFinder</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCopier</string>
				<key>Arguments</key>
				<dict>
					<key>source_pkg</key>
					<string>%found_filename%</string>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
