<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of handyPrint.</string>
	<key>Identifier</key>
	<string>com.github.ahousseini-recipes.download.handyPrint</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>handyPrint</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>curl_opts</key>
				<array>
					<string>--connect-timeout</string>
					<string>20</string>
					<string>--max-time</string>
					<string>120</string>
					<string>--retry-max-time</string>
					<string>60</string>
				</array>
				<key>re_pattern</key>
				<string>href=.*?handyPrint[._+-]v?(\d+(?:\.\d+)+)\.dmg</string>
				<key>url</key>
				<string>http://www.netputing.com/applications/handyprint-v5/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://s3.amazonaws.com/netputing/handyPrint/handyPrint+v%match%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/handyPrint.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.netputing.handyPrint" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6JK9WE675V")</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/handyPrint.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
