<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of LehrerOffice and creates a package.</string>
        <key>Identifier</key>
        <string>com.github.ahousseini-recipes.pkg.LehrerOffice</string>
        <key>Input</key>
        <dict>
            <key>BUNDLE_ID</key>
            <string>ch.rothsoft.lehreroffice.desktop</string>
            <key>NAME</key>
            <string>LehrerOffice</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.ahousseini-recipes.download.LehrerOffice</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>app_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/LehrerOffice.app</string>
                </dict>
                <key>Processor</key>
                <string>AppPkgCreator</string>
            </dict>
        </array>
    </dict>
</plist>