<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Set ARCH to 'x64' for Intel or 'arm64' for Apple Silicon</string>
	<key>Description</key>
	<string>Downloads the latest version of nRF Connect for Desktop and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.ahousseini-recipes.pkg.nRFConnectforDesktop</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>x64</string>
		<key>NAME</key>
		<string>nRF Connect for Desktop</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ahousseini-recipes.download.nRFConnectforDesktop</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%-%ARCH%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
