<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Leave ARCH_URL empty for Intel, set to '/arm64' for Apple Silicon.</string>
	<key>Description</key>
	<string>Downloads the latest version of RobloxStudio.</string>
	<key>Identifier</key>
	<string>com.github.ahousseini-recipes.download.RobloxStudio</string>
	<key>Input</key>
	<dict>
		<key>ARCH_URL</key>
		<string></string>
		<key>NAME</key>
		<string>RobloxStudio</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>clientVersionUpload\":\"(version-[a-z0-9]*)\",</string>
				<key>url</key>
				<string>https://clientsettingscdn.roblox.com/v2/client-version/MacStudio</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
				<key>url</key>
				<string>https://setup.rbxcdn.com/mac%ARCH_URL%/%match%-RobloxStudioApp.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/RobloxStudio.app</string>
				<key>requirement</key>
				<string>identifier "com.Roblox.RobloxStudio" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2CFABCH843"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
