<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Comment</key>
		<string>Created with Recipe Robot v2.0.0 (https://github.com/homebysix/recipe-robot)</string>
		<key>Description</key>
		<string>Downloads the latest version of Freeplane.</string>
		<key>Identifier</key>
		<string>com.github.ahousseini-recipes.download.Freeplane</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Freeplane</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.dmg</string>
					<key>url</key>
					<string>https://sourceforge.net/projects/freeplane/files/latest/download</string>
					<key>curl_opts</key>
					<array>
						<string>-L</string>
					</array>
					<key>request_headers</key>
					<dict>
						<key>user-agent</key>
						<string>AutoPkg/1.0 (Macintosh; Intel Mac OS X 10.15.7) curl/7.64.1</string>
					</dict>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/Freeplane.app</string>
					<key>requirement</key>
					<string>identifier "org.freeplane.launcher" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = CSHVD99Y7K</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
		</array>
	</dict>
</plist>
