<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of CMake.</string>
		<key>Identifier</key>
		<string>com.github.ahousseini-recipes.download.CMake</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>CMake</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>re_pattern</key>
					<string>cmake-([\d\.]+)-Darwin-x86_64.dmg</string>
					<key>result_output_var_name</key>
					<string>version</string>
					<key>url</key>
					<string>https://cmake.org/files/LatestRelease/</string>
				</dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%-%version%.dmg</string>
					<key>url</key>
					<string>https://cmake.org/files/LatestRelease/cmake-%version%-Darwin-x86_64.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>