<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of VEXcode IQ.</string>
		<key>Identifier</key>
		<string>com.github.ahousseini-recipes.download.VEXcodeIQ</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>VEXcode IQ</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.dmg</string>
					<key>url</key>
					<string>https://link.vex.com/vexcode-iqblocks-mac</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/VEXcode IQ.pkg</string>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: Vex Robotics, Inc. (3UM3U6335W)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
