<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Valid values for BUILD_TARGET are:
           - macOS12-x86_64
           - macOS1015-x86_64
           - MacOSX106-Universal-i386-x86_64
           - OSX109-x86_64</string>
	<key>Description</key>
	<string>Downloads the latest version of Natron.</string>
	<key>Identifier</key>
	<string>com.github.ahousseini-recipes.download.Natron</string>
	<key>Input</key>
	<dict>
		<key>BUILD_TARGET</key>
		<string>macOS12-x86_64</string>
		<key>NAME</key>
		<string>Natron</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>(Natron-\d+(?:.\d+)*-%BUILD_TARGET%\.dmg)$</string>
				<key>github_repo</key>
				<string>NatronGitHub/Natron</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
