<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of LEGO MINDSTORMS EV3 Home Edition.</string>
	<key>Identifier</key>
	<string>com.github.ahousseini-recipes.download.LEGOMINDSTORMSEV3HomeEdition</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>LEGO MINDSTORMS EV3 Home Edition</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>cask_name</key>
				<string>lego-mindstorms-ev3</string>
			</dict>
			<key>Processor</key>
			<string>com.github.ahousseini-recipes.SharedProcessors/HomebrewCaskURL</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: National Instruments (SKTKK2QZ74)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%/LEGO MINDSTORMS EV3 Home Edition.pkg</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
